000100*    COPYBOOK FOR CALLING PPICT					POS00001
000200* 								96/04/03
000300*    GENERATED: 96/04/03	LIBERO 2.10				96/04/03
000400*    REVISED:   96/04/03	PIETER HINTJENS 			96/04/03
000500* 								96/04/03
000600 01  PPICT-CONTROL.						96/04/03
000700*CONTENTS 							96/04/03
000800	   02  PPICT-OPERATION	       PIC X.				96/04/03
000900	   02  PPICT-FEEDBACK	       PIC X.				96/04/03
001000	   02  PPICT-THE-PICTURE.					96/04/03
001100	       03  PICT-CHAR	       PIC X	  OCCURS 40 TIMES.	96/04/03
001200	   02  PPICT-ERROR-MESSAGE.					96/04/03
001300	       03   PPICT-ERROR-CODE   PIC 9(02).			96/04/03
001400	       03   PPICT-ERROR-TEXT   PIC X(40).			96/04/03
001500	   02  PPICT-DECIMAL-POINT     PIC X(01).			96/04/03
001600	   02  PPICT-CURRENCY-SYMBOL   PIC X(01).			96/04/03
001700	   02  PPICT-ITEM-TYPE	       PIC X(01).			96/04/03
001800         88  PPICT-ALPHABETIC               VALUE IS "A".         96/04/03
001900         88  PPICT-NUMERIC                  VALUE IS "9".         96/04/03
002000         88  PPICT-ALPHANUMERIC             VALUE IS "X".         96/04/03
002100         88  PPICT-ALPHANUMERIC-EDITED      VALUE IS "E".         96/04/03
002200         88  PPICT-NUMERIC-EDITED           VALUE IS "N".         96/04/03
002300         88  PPICT-EXTERNAL-FLOAT           VALUE IS "F".         96/04/03
002400         88  PPICT-TYPE-UNDEFINED           VALUE IS "?".         96/04/03
002500	   02  PPICT-ITEM-SIZE	       PIC 9(7).			96/04/03
002600	   02  PPICT-ITEM-FLAGS.					96/04/03
002700	       03  PPICT-SIGNED-FLAG   PIC X(1).			96/04/03
002800	       03  PPICT-DIGIT-FLAG.					96/04/03
002900		   04  PPICT-DIGITS    PIC 9(2).			96/04/03
003000	       03  PPICT-DECIMAL-FLAG.					96/04/03
003100		   04  PPICT-DECIMALS  PIC 9(2).			96/04/03
003200									96/04/03